sdaiRemoveModelBN(Sdai_instS*,Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Removes a specified model from a schema instance.
\param schemaInstance [in] A schema instance.
\param repository     [in] A repository where the model should be found by its name.
\param modelName      [in] A string that contains the name of the model to be removed.